In [3]:
import pandas as pd

# list

data1 = [10, 20, 30 ,40]

df1 = pd.DataFrame(data1)

df1

    0
0  10
1  20
2  30
3  40

In [4]:
# dict
data2 = { 'A':[1,2,3], 'B':[4,5,6]}

df2 = pd.DataFrame(data2)

df2

   A  B
0  1  4
1  2  5
2  3  6

In [17]:
import pandas as pd
 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
df = pd.DataFrame(data)
 
df[['Name', 'Qualification', 'Age']]

     Name Qualification  Age
0     Jai           Msc   27
1  Princi            MA   24
2  Gaurav           MCA   22
3    Anuj           Phd   32

In [23]:
df.loc[0]  # outputs based on row/index label

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

In [37]:
index = ['A','B','C','C']
df1 = pd.DataFrame(data, index=index)
df1

     Name  Age    Address Qualification
A     Jai   27      Delhi           Msc
B  Princi   24     Kanpur            MA
C  Gaurav   22  Allahabad           MCA
C    Anuj   32    Kannauj           Phd

In [40]:
df1.loc['C']

     Name  Age    Address Qualification
C  Gaurav   22  Allahabad           MCA
C    Anuj   32    Kannauj           Phd

In [43]:
df1.iloc[1]  # outputs based on row/index int value

Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Name: B, dtype: object

In [44]:
df1.loc['A','Name']

'Jai'

In [45]:
import pandas as pd
 
import numpy as np
 
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

df = pd.DataFrame(dict)
 
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [46]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [47]:
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [48]:
df.dropna()

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

In [53]:
for i in df1.iterrows():
    print(i)

('A', Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: A, dtype: object)
('B', Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Name: B, dtype: object)
('C', Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Name: C, dtype: object)
('C', Name                Anuj
Age                   32
Address          Kannauj
Qualification        Phd
Name: C, dtype: object)

In [54]:
for i in df1.itertuples():
    print(i)

Pandas(Index='A', Name='Jai', Age=27, Address='Delhi', Qualification='Msc')
Pandas(Index='B', Name='Princi', Age=24, Address='Kanpur', Qualification='MA')
Pandas(Index='C', Name='Gaurav', Age=22, Address='Allahabad', Qualification='MCA')
Pandas(Index='C', Name='Anuj', Age=32, Address='Kannauj', Qualification='Phd')